%%计算风雍水面高度和波浪爬高
%%采用碾压土石坝设计规范SL274-2001
# 计算函数为chao_g.m

clc
clear
addpath(genpath(pwd))

# 水库所在地区,默认采用莆田试验站公式,1;丘陵、平原地区(W<26.5m/s,D<7500m)采用鹤地水库公式,2;内陆峡谷(W<20m/s,D<20000m)采用官厅水库公式,3
# 当hm/Hm > 0.2时超过鹤地水库公式、官厅水库公式计算范围;当g*D/W^2 < 20 || g*D/W^2 > 1000时超过官厅水库公式计算范围
sk = 1;

# 注意,此处m不是坡比,为坡比的倒数,规范中设定m<5
# 单坡的坡度系数 若坡角为a即等于cot(a)
m = 0.5;

# 累计频率P(%);设计波浪爬高值应根据工程等级确定,1,2,3级坝采用累积频率为1%的爬高值,4,5级级坝采用累积频率为5%的爬高值
P = 5;

%计算风速,m/s
W = 15.6;

%风区长度(m)
D = 300;

%坝前水深(m)
H = 2.7;

%水域平均水深(m)
Hm = 5;

%计算风向与坝轴线法线的夹角（弧度制）,规范其值不大于60度
beta = 0; 

# 综合摩阻系数，固定值
K = 3.6*10^(-6);

%重力加速度
g = 9.81;

# 斜坡的糙率渗透性系数
# 光滑不透水护面(沥青混凝土),1;混凝土或混凝土板,0.9;草皮,0.85~0.9;砌石,0.75~0.8;抛填两层块石(不透水基础),0.6~0.65;抛填两层块石(透水基础),0.5~0.55
Kdelta = 0.8;

# 计算风雍水面高及波浪爬高
[e, Rp] = chao_g(sk, K, g, m, P, W, D, H, Hm, beta, Kdelta)
