%%参考溢洪道设计规范SL253-2018
%%需要先选择堰型，分a,b两种

clc
clear

%%基础数据%%

%%堰上水深
H = 0:0.1:2.5;

%%堰型
xs = 3;  %%3：宽顶堰，底坎为直角或斜面；4：宽顶堰，底坎为圆角
cottheta = 9;  %%当底坎为直角或斜面时填写
r = 0.3;  %%当底坎为圆角时填写

K = 0.19;  %%闸墩形状影响系数（侧收缩系数），矩形取0.19，圆弧取0.10

%%数据
g = 9.81;

P1 = 0.01;  %%堰高，从底板计
b = 3.6;  %%堰孔宽度
B = 3.6;  %%总净宽
B1 = 3.6;  %%堰上游引水渠宽度

v = 3;  %%行近流速



%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%以下计算过程请谨慎修改%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%



%%计算参数
H0 = H + v^2/(2*g);

%%流量系数
if xs == 3
	%%表A.2.3-1 底坎为直角和斜面的宽顶堰流量系数表
	Z =   [0.385 0.385 0.385 0.385 0.385 0.385];
	Z = [Z;0.366 0.372 0.377 0.380 0.382 0.382];
	Z = [Z;0.356 0.365 0.373 0.377 0.380 0.381];
	Z = [Z;0.350 0.361 0.370 0.376 0.379 0.380];
	Z = [Z;0.345 0.357 0.368 0.375 0.378 0.379];
	Z = [Z;0.342 0.355 0.367 0.374 0.377 0.378];
	Z = [Z;0.333 0.349 0.363 0.371 0.385 0.377];
	Z = [Z;0.327 0.345 0.361 0.370 0.374 0.376];
	Z = [Z;0.325 0.344 0.360 0.369 0.374 0.376];
	Z = [Z;0.324 0.343 0.360 0.369 0.374 0.376];
	Z = [Z;0.320 0.340 0.358 0.368 0.373 0.375];
	
	X = [0 0.5 1.0 1.5 2.0 2.5];  %%cotθ(Δx/Δy)；大于等于2.5取2.5
	Y = [0.01 0.2 0.4 0.6 0.8 1.0 2.0 4.0 6.0 8.0 999];  %%P1/H0：约等于0取0.01，999代表无限大
	
	%%确定Xi
	if cottheta < 2.5
	    cottheta = cottheta;
	else
	    cottheta = 2.5;
	end
	Xi = cottheta;
	
	%%确定Yi
	temp = P1./H;  %%临时参数
	
	for i = 1:length(temp)  %%处理极大值和极小值
	    if temp(i) <0.01  
	        temp(i) = 0.01;
	    elseif temp(i) > 999
	        temp(i) = 999;
	    end
	end
	
	Yi = temp;
	
	%%查表得m
	m = interp2(X,Y,Z,Xi,Yi);
	m = m';  %%矩阵转置为1*m格式
elseif xs == 4
	%%表A.2.3-2 底坎为圆角的宽顶堰流量系数表
	Z =   [0.385 0.385 0.385 0.385 0.385 0.385 0.385 0.385];
	Z = [Z;0.372 0.374 0.375 0.377 0.379 0.380 0.381 0.382];
	Z = [Z;0.365 0.368 0.370 0.374 0.376 0.377 0.379 0.381];
	Z = [Z;0.361 0.364 0.367 0.370 0.374 0.376 0.378 0.380];
	Z = [Z;0.357 0.361 0.364 0.368 0.372 0.375 0.377 0.379];
	Z = [Z;0.355 0.359 0.362 0.366 0.371 0.374 0.376 0.378];
	Z = [Z;0.349 0.354 0.358 0.363 0.368 0.371 0.375 0.377];
	Z = [Z;0.345 0.350 0.355 0.360 0.366 0.370 0.373 0.376];
	Z = [Z;0.344 0.349 0.354 0.359 0.366 0.369 0.373 0.376];
	Z = [Z;0.340 0.346 0.351 0.357 0.364 0.368 0.372 0.375];
	
	X = [0.025 0.05 0.10 0.20 0.40 0.60 0.80 1.00];  %%r/H；大于等于1取1，小于等于0.025取0.025
	Y = [0.01 0.2 0.4 0.6 0.8 1.0 2.0 4.0 6.0 999];  %%P1/H：约等于0取0.01，999代表无限大
	
	%%确定Xi
	temp1 = r./H;  %%临时参数
	
	for i = 1:length(temp1)  %%处理极大值和极小值
	    if temp1(i) < 0.025
	        temp1(i) = 0.025;
	    elseif temp1(i) > 1
	        temp1(i) = 1;
	    end
	end
	Xi = temp1;
	
	%%确定Yi
	temp2 = P1/H;  %%临时参数
	
	for i = 1:length(temp2)  %%处理极大值和极小值
	    if temp2(i) <0.01
	        temp2(i) = 0.01;
	    elseif temp2(i) > 999
	        temp2(i) = 999;
	    end
	end
	Yi = temp2;
	
	%%查表得m
	m = interp2(X,Y,Z,Xi,Yi);
end

%%侧收缩系数
if b/B1 < 0.2  %%临时参数2：b/B1
	temp2 = 0.2;
else
	temp2 = b/B1;
end

for i = 1:length(H)
    if P1/H0(i) > 0.3  %%临时参数3：P1/H0
	    temp3(i) = 0.3;
    else
	    temp3(i) = P1/H0(i);
    end
end

%%单孔宽顶堰，多孔请参照规范
epsilon = 1 - K*(1-temp2).*(temp2)^(1/4)./(0.2+temp3).^(1/3);

%%计算流量%%

Q = m.*epsilon*B*(2*g)^0.5.*H0.^(3/2);

%%计算结果输出到文件%%

fid = fopen('save_date.txt','w+');  %打开文件（覆盖原文件内容，若文件不存在则创建）

fprintf(fid,'B = %d \t\r\n\r\n',B);

fprintf(fid,'H \t m \t epsilon \t Q \t \t \r\n');

for k = 1:length(H)
	fprintf(fid,'%d \t',H(k));
	fprintf(fid,'%d \t',m(k));
	fprintf(fid,'%d \t',epsilon(k));
	fprintf(fid,'%d \t',Q(k));
	fprintf(fid,'\r\n');  %换行
end

fclose(fid);  %关闭文件
