%%计算矩形或梯形断面下的正常水深，采用明渠均匀流公式
%%同时输出试算过程

clc
clear

%%数据%%

%渠道相关数据
Q0 = 325;  %流量
B = 5;  %宽度
m = 0;  %边坡
i = 0.035;  %纵坡
n = 0.017;  %糙率

%%水深变量
hmin = 0.1;  %试算起算水深
hmax = 10;  %试算最大水深
hbeta = 0.001  %试算间隔水深



%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%以下计算过程请谨慎修改%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%



%文件名
filename = 'output_file.txt';  %输出文件名

%%计算%%

%%计算参数
h = hmin:hbeta:hmax;  %试算水深

A = B*h + h.^2*m;  %断面面积
R = A./(B+2*h*(1+m^2)^0.5);  %水力半径
C = R.^(1/6)/n;  %谢齐系数

%%计算流量
Q = A.*C.*(R*i).^0.5;

%%选取差值最小的流量
beta = abs(Q-Q0);  %差值
[y,x] = min(beta);  %x：最小差值位置，y：最小差值

%%计算结果输出到文件%%

fid = fopen(filename,'w+');  %打开文件（覆盖原文件，若文件不存在则创建）

%%数据输出
fprintf(fid,'h = %d,Q = %d,v = %d,beta = %d\r\n\r\n',h(x),Q(x),Q(x)/A(x),beta(x));  %所求水深

%%试算过程输出
for k = 1:length(h)
	fprintf(fid,'%d \t',h(k));
	fprintf(fid,'%d \t',Q(k));
	fprintf(fid,'\r\n');  %换行
end

fclose(fid);  %关闭文件

h = h(x)
v = Q(x)/A(x)
