%%参考《溢洪道设计规范》
%%等宽矩形断面下挖式消力池

clc
clear
addpath(genpath(pwd))

%%1.参数
Q = 326;  %流量
b = 10;  %底宽
ht = 4; %消力池出口下游水深

P1 = 19;  %堰高
H = 2.55;  %堰前水深

g = 9.81;
sigma = 1.05; %水跃淹没度
phi = 0.9; %消力池出口段流量系数



%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%以下计算过程请谨慎修改%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%



%%1.5参数计算
q = Q/b;  %单宽流量

v0 =Q/(b*H);  %堰前流速

E0 = P1 + H + v0^2/(2*g);  %以收缩断面底部为基准面的堰前水流总比能

h1 = f_x_ssdm(q,E0,phi, g);  %收缩断面水深
v1 = Q/(b*h1);  %收缩断面流速

%%2.水跃计算
Fr = v1/(9.81*h1)^0.5;  %弗劳德数
h2 = 0.5*h1*((1+8*Fr^2)^0.5-1)  %%跃后水深
L1 = 10.8*h1*(Fr-1)^0.93;  %水跃长度
L2 = 6.9*(h2 - h1);  %水跃长度（Fr=5.5~9.0）

%%3.消力池计算
betaZ = Q^2/(2*g*b^2)*(1/(phi^2*ht^2)-1/(sigma^2*h2^2))
d = sigma*h2 - ht -betaZ
Lk1 = 0.8*L1
Lk2 = 0.8*L2
