%%参照溢洪道设计规范SL253-2018
%%计算溢洪道水面线，需要文件f_y_ss.m

clc
clear
addpath(genpath(pwd))

%% 一、参数
Q = 138;  %%流量
n = 0.017;  %%糙率
b = 17;  %%底宽
h(1) = 1.48;  %%初始水深

L = [0, 34, 56, 96, 98, 109];  %%所求断面位置
i = [0.13, 0.13, 0.15, 0.65, 0.3];  %%底坡

hmin = 0.01;  %%止算水深

xi = 1.1;  %%掺气水深修正系数，1.0~1.4，流速大者取大值



%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%以下计算过程请谨慎修改%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%



%将断面位置改为用断面距离差表示
for j = 1:length(L)-1
	Ld(j) = L(j+1) - L(j);
end

%初始断面流速及掺气水深
v(1) = Q/(b*h(1));
H(1) = (1+v(1)/100)*h(1);

%计算断面
for j = 1:length(Ld)
	[h(j+1), v(j+1), H(j+1)] = f_y_ss(Q, n, b, hmin, h(j), Ld(j), i(j), xi);
end

%% 三、输出
fid = fopen('save_date.txt','w+');  %打开文件（覆盖原文件内容，若文件不存在则创建）

fprintf(fid,'L \t h \t v \t H \t \r\n');

for k = 1:length(L)
	fprintf(fid,'%.2f \t',L(k));
	fprintf(fid,'%.2f \t',h(k));
	fprintf(fid,'%.4f \t',v(k));
	fprintf(fid,'%.2f \t',H(k));
	fprintf(fid,'\r\n');  %换行
end

fclose(fid);  %关闭文件
