%%按明渠均匀流计算
%%求对应流量下管涵直径
%%D:所求直径;q,对应流量;dr,对应充满度

clc
clear

%% 一、参数
i = 0.002;  %纵坡
n = 0.017;  %糙率

dr = 0.8;  %充满度要求

q = 23;  %待求流量

dmax = 5;  %最大试算直径



%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%以下计算过程请谨慎修改%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%



d = 0.1:0.01:dmax;

r = d./2;  %%半径

theta  = acos(1-2*dr);  %水面与圆心夹角的一半

Ad =  pi.*r.^2; %管涵断面面积

A = 2*r.*theta - r.*r*cos(theta)*sin(theta);  %过水断面面积
L = 2*r*theta;  %湿周
R = A./L;  %水力半径
C = R.^(1/6)/n;  %谢齐系数

%%计算流量
Q = A.*C.*(R*i).^0.5;

%% 三、输出
D = interp1(Q,d,q,'linear');  %%所需直径

D,q,dr
