%%参考溢洪道设计规范SL253-2018
%%需要先选择堰型，分a,b两种

clc
clear

%%基础数据%%

%%堰型
xs = 1;  %%1：a型驼峰堰，相对较缓；2：b型驼峰堰，相对较陡
K = 0.19;  %%闸墩形状影响系数（侧收缩系数），矩形取0.19，圆弧取0.10

%%数据
g = 9.81;

P1 = 2.5;  %%堰高，从底板计
B = 8;  %%总净宽，计算流量时用到
b = 7;  %%堰孔宽度，计算侧收缩系数时用到
B1 = 7;  %%堰上游引水渠宽度，计算侧收缩系数时用到

v = 0;  %%行近流速
H = 10.38;  %%堰上水深



%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%以下计算过程请谨慎修改%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%



H0 = H + v^2/(2*g);  %%堰上行近水头

%%计算流量系数
temp1 = P1/H0;  %%临时参数1：P1/H0

if xs == 1
    if temp1 <= 0.24
	    m = 0.385+0.171*(temp1)^0.657;
    else
	    m = 0.414*temp1^(-0.0652);
    end
elseif xs == 2
    if temp1 <= 0.34
	    m = 0.385 + 0.224*temp1^0.934;
    else
	    m = 0.452*temp1^(-0.032);
    end
end

%%计算侧收缩系数
if b/B1 < 0.2  %%临时参数2：b/B1
	temp2 = 0.2;
else
	temp2 = b/B1;
end

if P1/H0 > 0.3  %%临时参数3：P1/H0
	temp3 = 0.3;
else
	temp3 = P1/H0;
end

epsilon = 1 - K*(1-temp2)*(temp2)^(1/4)/(0.2+temp3)^(1/3);  %%单孔宽顶堰，多孔请参照规范

%%计算流量%%

Q = m*epsilon*B*(2*g)^0.5*H0^(3/2)
